#include <stdio.h>
#include <locale.h>
int a1()
{
	printf("123\n");
}
int a2()
{
	printf("1\n2\n3\n");
}
int a3()
{
	printf("1\n 2\n  3\n");
}
int a4()
{
	printf("%d\n%2d\n%3d\n%4d\n", 1, 2, 3, 4);
}
int a5()
{
	printf("%10.3f\n ", 12.234657);
	printf("%10.5f\n ", 12.234657);
}
int a7()
{
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n", 7, 5, 7 % 5);
	printf("Произведение чисел %d и %d равно %d\n", 2000, 4, 2000 * 4);
}
int a10()
{
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000);
}


void main()
{
	setlocale(LC_CTYPE, "RUS");
	a1();
	a2();
	a3();
	a4();
	a5();
	a7();
	a10();
}